backend/controllers/CardController.php

SELECT `id`, `type_id`, `type_name` FROM `fj_insurance_coverage` GROUP BY `type_id`
---
    public function actionCreate()
    {
        $card_coupons_grant_model = new CardCouponsGrant();
        $insurance_coverage_model = new InsuranceCoverage();
        $insurance_coverage_data = $insurance_coverage_model::find()->select('id,type_id,type_name')->groupBy('type_id')->asArray()->all();

SELECT `id`, `company_id`, `company_name` FROM `fj_insurance_coverage` WHERE `type_id`='4' GROUP BY `company_id`
---
    public function actionCompany()
    {
        $type_id = Yii::$app->request->post('type_id');

        if (!$type_id) {
            return $this->getCheckNo('参数错误');
        }

        $company_list = InsuranceCoverage::find()->select('id,company_id,company_name')->where(['type_id' => $type_id])->groupBy('company_id')->asArray()->all();

SELECT `id`, `coverage_code` FROM `fj_insurance_coverage` WHERE `company_id`='1'
---
    public function actionCoveragelist()
    {
        $company_id = Yii::$app->request->post('company_id');

        if (!$company_id) {
            return $this->getCheckNo('参数错误');
        }

        $coverage_list = InsuranceCoverage::find()->select('id,coverage_code')->where(['company_id' => $company_id])->asArray()->all();

SELECT * FROM `fj_card_coupons_grant` WHERE `card_number`='0001000'
SELECT * FROM `fj_card_coupons_grant` WHERE (LENGTH(card_number)=7) AND (`card_number` NOT REGEXP  '[a-z]+') ORDER BY `id` DESC
---
    private function getCardNumber($number = 1000)
    {
        $has = CardCouponsGrant::find()->where(['card_number'=>'0001000'])->asArray()->one();
        $prefix = '0001';

        if (empty($has)) {
            return array(
                array($prefix, $number, 0)
            );
        }

        $data = CardCouponsGrant::find()->where('LENGTH(card_number)=7')->andWhere(['NOT REGEXP ','card_number','[a-z]+'])->orderBy('id desc')->asArray()->one();