common/models/Admin.php

SELECT * FROM `fj_admin` WHERE (`username`='admin') AND (`status`=1)
---
	public static function findByUsername($username)
	{
		return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `fj_admin` WHERE (`id`=1) AND (`status`=1)
---
	public static function findIdentity($id)
	{
		return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);