common/models/CardCouponsGrant.php

    public static function getCoverageCodeList($seller_id)
    {
        if(!$seller_id){
            return [];
        }
        return static::find()
            ->where(['seller_id'=>$seller_id,'status'=>0])
            ->groupBy('coverage_code')
            ->orderBy('coverage_id desc')
            ->select('coverage_id,coverage_code')
            ->all();
---
SELECT `coverage_id`, `coverage_code` FROM `fj_card_coupons_grant` WHERE (`seller_id`='2') AND (`status`=0) GROUP BY `coverage_code` ORDER BY `coverage_id` DESC