common/models/Member.php

SELECT * FROM `fj_member` WHERE (`phone`='13982146367') AND (`state`=1)
---
	public static function findByPhone($phone)
	{
		return static::findOne(['phone' => $phone, 'state' => self::STATUS_ACTIVE]);

SELECT * FROM `fj_member` WHERE (`member_id`='5937') AND (`state`=1)
---
	public static function findIdentity($id)
	{
		return static::findOne(['member_id' => $id, 'state' => self::STATUS_ACTIVE]);

SELECT * FROM `fj_seller` WHERE (`member_id`='5937')
---
	public function getSellerInfo($where = array())
	{
		return $this->hasOne(Seller::className(),['member_id'=>'member_id'])->where($where)->one();