common/models/Seller.php

    public static function getSellerInfo($seller_id)
    {
        if(!$seller_id){
            return [];
        }
		$cache = Yii::$app->cache;
		$cache_key = 'seller_'.$seller_id;
		if($row = $cache->get($cache_key)){
			return $row;
		}
		$row = self::find()->where(['seller_id'=>$seller_id])->one();
---
SELECT * FROM `fj_seller` WHERE `seller_id`='10'

    public static function getSeller($member_id=''){
        if(!$member_id) return false;
        return static::find()->where(['member_id'=>$member_id])->one();
---
SELECT * FROM `fj_seller` WHERE `member_id`='5931'

    public static  function  getIdKeySeller($tj=[]){
        $result=self::find()->where($tj)->asArray()->all();
---
SELECT * FROM `fj_seller` WHERE `seller_id` IN ('2', '2', '2', '2', '2', '2', '2', '2', '2', '2')