maintainer/controllers/BorderController.php

                    $query->andWhere(['order_state'=>(int)$status]);
                }
            }
			$total = $query->count('o.order_id');
---
SELECT COUNT(o.order_id) FROM `fj_order` `o`, `fj_order_extend` `o_e`, `fj_card_coupons_grant` `g` WHERE o.order_id = o_e.order_id and o.order_id=g.order_id and o_e.seller_id='2'