maintainer/controllers/CardController.php

    public function actionAccrod()
    {
        $seller_info = $this->seller;
        $seller_id = $seller_info->seller_id;
        $insurance_list = Seller::find()->where(['pid' => $seller_id, 'status' => 1])->all();
---
SELECT * FROM `fj_seller` WHERE (`pid`='2') AND (`status`=1)