maintainer/controllers/SiteController.php

	public function actionIndex()
	{
		if (Yii::$app->user->isGuest) {
			return $this->redirect(['site/login']);
		}
		$seller_id=Yii::$app->user->identity->getSellerInfo()->seller_id;
		if($seller_id == 1){
			return $this->redirect(['site/login']);
		}
		$model = Msg::find();
		$model->where(['seller_id'=>$seller_id]);
		$count=$model->count();
		$pageSize=15;
		$page=Yii::$app->request->get('page',0);
		if($page < 1 ){
			$page =0;
		}
		$dataProvider = new ActiveDataProvider([
				'query' =>$model->orderBy('status asc')->limit($pageSize)->offset($pageSize*$page)->asArray(),
				'pagination' => [
						'pageSize' => $pageSize,
						'page' => $page,
						'totalCount' => $count
				]
		]);
---
SELECT COUNT(*) FROM `fj_msg` WHERE `seller_id`='2'
SELECT * FROM `fj_msg` WHERE `seller_id`='2' ORDER BY `status` LIMIT 15